HalloYang06/PSOC_E84_robot/applications/main.c
static void wake_off(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_request_listen_stop();
    rt_kprintf("wake_off ret=%d\n", ret);
}
MSH_CMD_EXPORT(wake_off, Stop continuous wake listening on M33->CM55);

static void wake_dump_pcm(int argc, char **argv)
{
    const char *path = "/latest_wake.pcm";
    rt_err_t ret;

    if ((argc >= 2) && (argv[1] != RT_NULL) && (argv[1][0] != '\0'))
    {
        path = argv[1];
    }

    ret = voice_service_dump_latest_pcm(path);
    rt_kprintf("wake_dump_pcm ret=%d path=%s\n", ret, path);
}
MSH_CMD_EXPORT(wake_dump_pcm, Save latest CM55 wake PCM to a raw pcm file);

static void xz_url(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("xz_url current=%s\n", xiaozhi_voice_relay_get_url());
        return;
    }

    ret = xiaozhi_voice_relay_set_url(argv[1]);
    rt_kprintf("xz_url ret=%d url=%s\n", ret, xiaozhi_voice_relay_get_url());
}
MSH_CMD_EXPORT(xz_url, Get or set Xiaozhi websocket URL);

static void xz_token(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("xz_token configured=%d\n", xiaozhi_voice_relay_has_token() ? 1 : 0);
        return;
    }

    ret = xiaozhi_voice_relay_set_token(argv[1]);
    rt_kprintf("xz_token ret=%d configured=%d\n", ret, xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token, Set Xiaozhi platform relay token);

static void xz_token_begin(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = xiaozhi_voice_relay_token_update_begin();
    rt_kprintf("xz_token_begin ret=%d\n", ret);
}
MSH_CMD_EXPORT(xz_token_begin, Begin chunked Xiaozhi platform token update);

static void xz_token_part(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: xz_token_part <token_chunk_48_to_60_chars>\n");
        return;
    }

    ret = xiaozhi_voice_relay_token_update_part(argv[1]);
    rt_kprintf("xz_token_part ret=%d len=%lu\n",
               ret,
               (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(xz_token_part, Append one chunk to Xiaozhi platform token);

static void xz_token_commit(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = xiaozhi_voice_relay_token_update_commit();
    rt_kprintf("xz_token_commit ret=%d configured=%d\n",
               ret,
               xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token_commit, Commit chunked Xiaozhi platform token);

static void xz_token_clear(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);

    xiaozhi_voice_relay_token_update_clear();
    rt_kprintf("xz_token_clear configured=%d\n", xiaozhi_voice_relay_has_token() ? 1 : 0);
}
MSH_CMD_EXPORT(xz_token_clear, Clear Xiaozhi platform token);

static void xz_reconnect(int argc, char **argv)
{
    rt_err_t ret;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    ret = voice_service_reconnect_xiaozhi();
    rt_kprintf("xz_reconnect ret=%d\n", ret);
}
MSH_CMD_EXPORT(xz_reconnect, Reconnect Xiaozhi websocket after URL or token change);

static void m55_wifi_ssid(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: m55_wifi_ssid <ssid>\n");
        return;
    }

    ret = wifi_config_set_ssid(argv[1]);
    rt_kprintf("m55_wifi_ssid ret=%d len=%lu\n", ret, (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(m55_wifi_ssid, Set CM55 WiFi SSID in RAM);

static void m55_wifi_password(int argc, char **argv)
{
    rt_err_t ret;

    if (argc < 2)
    {
        rt_kprintf("usage: m55_wifi_password <password>\n");
        return;
    }

    ret = wifi_config_set_password(argv[1]);
    rt_kprintf("m55_wifi_password ret=%d len=%lu\n", ret, (unsigned long)rt_strlen(argv[1]));
}
MSH_CMD_EXPORT(m55_wifi_password, Set CM55 WiFi password in RAM);

static void m55_wifi_connect(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
    rt_kprintf("m55_wifi_connect ret=%d\n", wifi_config_connect());
}
MSH_CMD_EXPORT(m55_wifi_connect, Connect CM55 WiFi using staged SSID/password);

static void m55_wifi_save(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
}
MSH_CMD_EXPORT(m55_wifi_save, Save CM55 WiFi SSID/password to local flash);

static void m55_wifi_forget(int argc, char **argv)
{
    RT_UNUSED(argc);
    RT_UNUSED(argv);
    rt_kprintf("m55_wifi_forget ret=%d\n", wifi_config_forget());
}
MSH_CMD_EXPORT(m55_wifi_forget, Remove saved CM55 WiFi credentials);

static void m55_wifi_auto(int argc, char **argv)
{
    rt_bool_t enable;

    if (argc < 2)
    {
        wifi_config_snapshot_t snapshot;
        wifi_config_get_snapshot(&snapshot);
        rt_kprintf("usage: m55_wifi_auto <0|1>, current=%lu\n",
                   (unsigned long)snapshot.auto_connect);
        return;
    }

    enable = (argv[1][0] != '0') ? RT_TRUE : RT_FALSE;
    rt_kprintf("m55_wifi_auto ret=%d\n", wifi_config_set_auto_connect(enable));
    rt_kprintf("m55_wifi_save ret=%d\n", wifi_config_save());
}
MSH_CMD_EXPORT(m55_wifi_auto, Enable or disable saved WiFi auto-connect);

static void m55_wifi_status(int argc, char **argv)
{
    wifi_config_snapshot_t snapshot;

    RT_UNUSED(argc);
    RT_UNUSED(argv);

    wifi_config_get_snapshot(&snapshot);
    rt_kprintf("[wifi_config] ssid=%s saved=%lu auto=%lu storage=%ld connected=%lu ready=%lu rssi=%ld netdev=%s flags=0x%lx last=%ld whd=%ld/%ld\n",
               snapshot.ssid[0] ? snapshot.ssid : "(empty)",
               (unsigned long)snapshot.saved,
               (unsigned long)snapshot.auto_connect,
               (long)snapshot.storage_result,
               (unsigned long)snapshot.wlan_connected,
               (unsigned long)snapshot.wlan_ready,
               (long)snapshot.wlan_rssi,
               snapshot.netdev_name[0] ? snapshot.netdev_name : "(none)",
               (unsigned long)snapshot.netdev_flags,
               (long)snapshot.last_result,
               (long)snapshot.whd_stage,
               (long)snapshot.whd_result);
}
MSH_CMD_EXPORT(m55_wifi_status, Print saved CM55 WiFi config and live status);

static void m55_wifi_print_aps(void)
{
    rt_int32_t i;
    rt_int32_t count = wifi_config_get_scan_count();

